20260824/20260824/Documents/ПроизводственнаяОперация2_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПроизводственнаяОперация2_2</Name>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.СБ_ДвиженияДрагоценныхМеталлов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>СБ_ДрагоценныеМеталлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДрагоценныеМатериалы</v8:Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛигатурныйВес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧистыйВес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Родитель</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РодительНоменклатура</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СБ_ДрагоценныеМеталлыРасход</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДрагоценныеМатериалы</v8:Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛигатурныйВес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧистыйВес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>13</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Родитель</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РодительНоменклатура</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

20260824/20260824/Documents/ПроизводственнаяОперация2_2/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиФормы

&НаСервере
Процедура СБ_ПриОткрытииПослеНаСервере() 
	
	СБ_РаботаСДрагоценнымиМеталлами.ЗаполнитьПустуюТаблицуДрагМеталлы(Объект.МатериалыИРаботы, Объект.СБ_ДрагоценныеМеталлыРасход,); 
	
	//Дерево = РеквизитФормыВЗначение("ДеревоДрагМеталлы");
	ДеревоИзТаблицы = СБ_РаботаСДрагоценнымиМеталлами.ВыгрузитьТаблицуЗначенийВДеревоЗначений(Объект.СБ_ДрагоценныеМеталлыРасход.Выгрузить(), "Родитель", "Родитель");
	ЗначениеВРеквизитФормы(ДеревоИзТаблицы, "ДеревоДрагМеталлы");
	
	СБ_РаботаСДрагоценнымиМеталлами.ЗаполнитьПустуюТаблицуДрагМеталлы(Объект.ВыходныеИзделия, Объект.СБ_ДрагоценныеМеталлы,); 
	
	//Дерево = РеквизитФормыВЗначение("ДеревоДрагМеталлы");
	ДеревоИзТаблицы = СБ_РаботаСДрагоценнымиМеталлами.ВыгрузитьТаблицуЗначенийВДеревоЗначений(Объект.СБ_ДрагоценныеМеталлы.Выгрузить(), "Родитель", "Родитель");
	ЗначениеВРеквизитФормы(ДеревоИзТаблицы, "ДеревоДрагМеталлы");

	//Если ЗначениеЗаполнено(Объект.Склад) Тогда
		//Элементы.ГруппаДрагМеталлыВыпуск.Видимость = СБ_РаботаСДрагоценнымиМеталлами.СкладИспользуетОрдернуюСхему(Объект.Склад);
		//Элементы.ГруппаДрагМеталлыРасход.Видимость = Элементы.ГруппаДрагМеталлыВыпуск.Видимость;
	//Иначе
	//	Элементы.ГруппаДрагоценныеМеталлы.Видимость = Ложь;
	//	Элементы.ГруппаДрагМеталлыРасход.Видимость = Ложь;
	//	Объект.ГруппаДрагМеталлыВыпуск.Очистить();
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СБ_ПриОткрытииПосле(Отказ)
	СБ_ПриОткрытииПослеНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиДрагоценныеМеталлы

&НаКлиенте
Процедура ОбщееПересчитатьТаблицуДрагоценныеМеталлыРасход(Элемент)
	ПересчитатьТаблицуДрагоценныеМеталлыРасход();
КонецПроцедуры

&НаКлиенте
Процедура ОбщееПересчитатьТаблицуДрагоценныеМеталлы(Элемент)
	ПересчитатьТаблицуДрагоценныеМеталлы();
КонецПроцедуры

&НаКлиенте
Процедура СБ_ДеревоДрагМеталлыЛигатурныйВесПриИзмененииПосле(Элемент)
	СБ_ДеревоДрагМеталлыЛигатурныйВесПриИзмененииПослеНаСервере();
КонецПроцедуры

&НаСервере
Процедура СБ_ДеревоДрагМеталлыЛигатурныйВесПриИзмененииПослеНаСервере()
	//ДеревоВТаблицу = РеквизитФормыВЗначение("ДеревоДрагМеталлы");           
	//Объект.СБ_ДрагоценныеМеталлы.Очистить();
	//СБ_РаботаСДеревомЗначений.ВыгрузитьДеревоЗначенийВТаблицуЗначений(ДеревоВТаблицу, Объект.СБ_ДрагоценныеМеталлы);
	ПересчитатьТаблицуДрагоценныеМеталлы();
КонецПроцедуры

&НаСервере
Процедура СБ_ДеревоДрагМеталлыЧистыйВесПриИзмененииПослеНаСервере()
	ДеревоВТаблицу = РеквизитФормыВЗначение("ДеревоДрагМеталлы");           
	Объект.СБ_ДрагоценныеМеталлы.Очистить();              
	
	ПересчитатьВесаДерева(ДеревоВТаблицу);
	ЗначениеВРеквизитФормы(ДеревоВТаблицу, "ДеревоДрагМеталлы");
	
	СБ_РаботаСДеревомЗначений.ВыгрузитьДеревоЗначенийВТаблицуЗначений(ДеревоВТаблицу, Объект.СБ_ДрагоценныеМеталлы);
КонецПроцедуры

&НаКлиенте
Процедура СБ_ДеревоДрагМеталлыЧистыйВесПриИзмененииПосле(Элемент) 
	
	СБ_ДеревоДрагМеталлыЧистыйВесПриИзмененииПослеНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура СБ_СБ_ДрагоценныеМеталлыПЕредУдалениемПослеНаСервере()
	//ДеревоВТаблицу = РеквизитФормыВЗначение("ДеревоДрагМеталлы");           
	//Объект.СБ_ДрагоценныеМеталлы.Очистить();
	//СБ_РаботаСДеревомЗначений.ВыгрузитьДеревоЗначенийВТаблицуЗначений(ДеревоВТаблицу, Объект.СБ_ДрагоценныеМеталлы);
	ПересчитатьТаблицуДрагоценныеМеталлы();
КонецПроцедуры

&НаКлиенте
Процедура СБ_ДеревоДрагМеталлыПослеУдаленияПосле(Элемент)
	ПересчитатьТаблицуДрагоценныеМеталлы();
КонецПроцедуры                                     

&НаКлиенте
Процедура СБ_ДеревоДрагМеталлыРасходПослеУдаленияПосле(Элемент)
	ПересчитатьТаблицуДрагоценныеМеталлы();	
КонецПроцедуры           

#КонецОбласти    

#Область ОбработчикиТовары

&НаКлиенте
Процедура СБ_ТоварыНоменклатураПриИзмененииПосле(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СБ_ТоварыСтатусУказанияСерийПриИзмененииПосле(Элемент) 
	
	ПересчитатьКоличество(ТекущийЭлемент.ТекущиеДанные.Номенклатура, ТекущийЭлемент.ТекущиеДанные.Характеристика, ТекущийЭлемент.ТекущиеДанные.Серия, ТекущийЭлемент.ТекущиеДанные.КоличествоУпаковок, Объект.Склад, ТекущийЭлемент.ТекущиеДанные.Упаковка);  
	ПересчитатьТаблицуДрагоценныеМеталлы();               
	
КонецПроцедуры

&НаКлиенте
Процедура СБ_ТоварыКоличествоУпаковокПриИзмененииПосле(Элемент)       
	
	
	ПересчитатьКоличество(ТекущийЭлемент.ТекущиеДанные.Номенклатура, ТекущийЭлемент.ТекущиеДанные.Характеристика, ТекущийЭлемент.ТекущиеДанные.Серия, ТекущийЭлемент.ТекущиеДанные.КоличествоУпаковок, , ТекущийЭлемент.ТекущиеДанные.Упаковка);  
	ПересчитатьТаблицуДрагоценныеМеталлы();
	
КонецПроцедуры

#КонецОбласти 

#Область Прочее

&НаСервереБезКонтекста
Процедура ПересчитатьВесаДерева(Дерево) Экспорт
	ПересчитатьСуммыСтрок(Дерево.Строки);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПересчитатьСуммыСтрок(Строки)        
	
	Для каждого Строка Из Строки Цикл
		
		Если Строка.Строки.Количество() > 0 Тогда
			//ПересчитатьУзел(Строка.Строки);   
			
			СуммаЧистый = 0;
			СуммаЛигатурный = 0;
			Для каждого Дочерняя Из Строка.Строки Цикл
				СуммаЧистый = СуммаЧистый + Дочерняя.ЧистыйВес;
				//СуммаЛигатурный = СуммаЛигатурный + Дочерняя.ЛигатурныйВес;
			КонецЦикла;
			
			Строка.ЧистыйВес = СуммаЧистый;
			//Строка.ЛигатурныйВес = СуммаЛигатурный;
		КонецЕсли;  
		
	КонецЦикла;       
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьКоличество(Номенклатура, Характеристика, Серия, КоличествоУпаковок, Склад, ЕдиницаИзмерения) Экспорт  
	
	СтруктураТовар =Новый Структура();
	СтруктураТовар.Вставить("Номенклатура", Номенклатура);
	СтруктураТовар.Вставить("Характеристика", Характеристика);
	СтруктураТовар.Вставить("Серия", Серия);
	СтруктураТовар.Вставить("КоличествоУпаковок", КоличествоУпаковок);
	СтруктураТовар.Вставить("Склад", Склад);
	СтруктураТовар.Вставить("ЕдиницаИзмерения", ЕдиницаИзмерения);
	Дерево = ПересчитатьСтрокуДеревеПриИзмененииСтрокиТовара(СтруктураТовар, РеквизитФормыВЗначение("ДеревоДрагМеталлы"));
	
	ЗначениеВРеквизитФормы(Дерево, "ДеревоДрагМеталлы"); 
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПересчитатьСтрокуДеревеПриИзмененииСтрокиТовара(СтруктураТовар, Дерево)        
	
	СтрокаНайдена = Ложь;
	Для каждого Строка Из Дерево.Строки Цикл
		
		Если СтруктураТовар.Номенклатура = Строка.Номенклатура И СтруктураТовар.Серия = Строка.Серия И СтруктураТовар.Характеристика = Строка.Характеристика Тогда
			СтрокаНайдена = Истина;	
			Дерево.Строки.Удалить(Строка);
			ДобавитьСтрокуВДерево(СтруктураТовар, Дерево);
			Возврат Дерево;
		КонецЕсли;  
		
	КонецЦикла;
	
	Если Не СтрокаНайдена Тогда
		Возврат ДобавитьСтрокуВДерево(СтруктураТовар, Дерево);	
	КонецЕсли;     
	
	Возврат Дерево;
	
КонецФункции

&НаСервереБезКонтекста
Функция ДобавитьСтрокуВДерево(СтруктураЗаполнения, Дерево)        
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НоменклатураДрагоценныеМатериалы.Ссылка КАК НоменклатураРодитель,
	|	НоменклатураДрагоценныеМатериалы.ДрагоценныйМатериал КАК ДрагоценныйМатериал,
	|	НоменклатураДрагоценныеМатериалы.Количество КАК КоличествоДрагоценныйМатериал,
	|	НоменклатураДрагоценныеМатериалы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	НоменклатураДрагоценныеМатериалы.СБ_ПроцентСодержания КАК СБ_ПроцентСодержания,
	|	НоменклатураДрагоценныеМатериалы.Ссылка.СБ_ИспользоватьПроцентСодержания КАК СБ_ИспользоватьПроцентСодержания,
	|	НоменклатураДрагоценныеМатериалы.Ссылка.ВесЧислитель КАК Вес
	|ИЗ
	|	Справочник.Номенклатура.ДрагоценныеМатериалы КАК НоменклатураДрагоценныеМатериалы
	|ГДЕ
	|	НоменклатураДрагоценныеМатериалы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СтруктураЗаполнения.Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	НоваяСтрокаРодитель = Дерево.Строки.Добавить();
	
	НоваяСтрокаРодитель.Номенклатура = СтруктураЗаполнения.Номенклатура;
	//НоваяСтрока.Номенклатура = Выборка.ДрагоценныйМатериал;
	НоваяСтрокаРодитель.Характеристика = СтруктураЗаполнения.Характеристика;
	НоваяСтрокаРодитель.Количество = СтруктураЗаполнения.КоличествоУпаковок; 
	//НоваяСтрока.Количество = Выборка.КоличествоУпаковок;
	НоваяСтрокаРодитель.ЕдиницаИзмерения = СтруктураЗаполнения.ЕдиницаИзмерения;
	НоваяСтрокаРодитель.Склад = СтруктураЗаполнения.Склад;
	НоваяСтрокаРодитель.Серия = СтруктураЗаполнения.Серия;
	//НоваяСтрокаРодитель.ЛигатурныйВес = Выборка.Вес;
	НоваяСтрокаРодитель.ЧистыйВес = 0;
	
	Пока Выборка.Следующий() Цикл
		
		НоваяСтрокаРодитель.ЛигатурныйВес = Выборка.Вес;
		
		НоваяСтрока = НоваяСтрокаРодитель.Строки.Добавить();
		
		НоваяСтрока.Номенклатура = Выборка.ДрагоценныйМатериал;
		НоваяСтрока.Характеристика = НоваяСтрокаРодитель.Характеристика;
		//НоваяСтрока.Количество = НоваяСтрокаРодитель.Количество; 
		//НоваяСтрока.ЕдиницаИзмерения = Выборка.ЕдиницаИзмерения;
		//НоваяСтрока.Склад = НоваяСтрокаРодитель.Склад;
		//НоваяСтрока.Серия = НоваяСтрокаРодитель.Серия;
		//НоваяСтрока.ЛигатурныйВес = Выборка.Вес;
		
		Если Выборка.СБ_ИспользоватьПроцентСодержания Тогда
			НоваяСтрока.ЧистыйВес = НоваяСтрокаРодитель.Количество * Выборка.Вес * (Выборка.СБ_ПроцентСодержания / 100);	
		Иначе
			НоваяСтрока.ЧистыйВес = НоваяСтрокаРодитель.Количество * Выборка.КоличествоДрагоценныйМатериал;
		КонецЕсли;
		
		НоваяСтрокаРодитель.ЧистыйВес = НоваяСтрокаРодитель.ЧистыйВес + НоваяСтрока.ЧистыйВес;
		
		
		
		
		
	КонецЦикла;
	
	Возврат Дерево;
	
КонецФункции 

&НаСервере
Процедура ПересчитатьТаблицуДрагоценныеМеталлы()        
	
	ДеревоВТаблицу = РеквизитФормыВЗначение("ДеревоДрагМеталлы");           
	Объект.СБ_ДрагоценныеМеталлы.Очистить();
	СБ_РаботаСДеревомЗначений.ВыгрузитьДеревоЗначенийВТаблицуЗначений(ДеревоВТаблицу, Объект.СБ_ДрагоценныеМеталлы);

КонецПроцедуры 

&НаСервере
Процедура ПересчитатьТаблицуДрагоценныеМеталлыРасход()        
	
	ДеревоВТаблицу = РеквизитФормыВЗначение("ДеревоДрагМеталлыРасход");           
	Объект.СБ_ДрагоценныеМеталлыРасход.Очистить();
	СБ_РаботаСДеревомЗначений.ВыгрузитьДеревоЗначенийВТаблицуЗначений(ДеревоВТаблицу, Объект.СБ_ДрагоценныеМеталлыРасход);

КонецПроцедуры


&НаСервере
Процедура СБ_ПересчитатьДрагМеталлыПослеНаСервере()      
	
	ОбъектТовары = РеквизитФормыВЗначение("Объект.ВыходныеИзделия");
	СБ_РаботаСДрагоценнымиМеталлами.ЗаполнитьПустуюТаблицуДрагМеталлы(ОбъектТовары, Объект.СБ_ДрагоценныеМеталлы,, Истина);
	ЗаполнитьСерииПоВнешнейТаблице(Объект.СБ_ДрагоценныеМеталлы, Объект.ВыходныеИзделияСерии);
	                                           
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Родитель", "Родитель");
	ДеревоИзТаблицы = СБ_РаботаСДрагоценнымиМеталлами.ВыгрузитьТаблицуЗначенийВДеревоЗначений(Объект.СБ_ДрагоценныеМеталлы.Выгрузить(), "РодительНоменклатура", "РодительНоменклатура");
	
	ЗначениеВРеквизитФормы(ДеревоИзТаблицы, "ДеревоДрагМеталлы");                        
	
КонецПроцедуры

&НаКлиенте
Процедура СБ_ПересчитатьДрагМеталлыРасходПосле(Команда)
	СБ_ПересчитатьДрагМеталлыРасходПослеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСерииПоВнешнейТаблице(ТаблицаИсходная, ТаблицаДонор)
	Для Каждого СтрокаТЧ Из ТаблицаИсходная Цикл
		Если Не ЗначениеЗаполнено(СтрокаТЧ.Серия) Тогда
			ПараметрыОтбора = Новый Структура;
    		ПараметрыОтбора.Вставить("Номенклатура", СтрокаТЧ.Номенклатура); 
			ПараметрыОтбора.Вставить("Характеристика", СтрокаТЧ.Характеристика);
			ПараметрыОтбора.Вставить("Количество", СтрокаТЧ.Количество);
    		НайденныеСтроки = ТаблицаДонор.НайтиСтроки(ПараметрыОтбора);
			
			Если НайденныеСтроки.Количество() > 0 Тогда
				СтрокаТЧ.Серия = НайденныеСтроки[0].Серия;	
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры 

&НаСервере
Процедура СБ_ПересчитатьДрагМеталлыРасходПослеНаСервере()      
	
	ОбъектТовары = РеквизитФормыВЗначение("Объект.РасходМатериаловИРабот");
	СБ_РаботаСДрагоценнымиМеталлами.ЗаполнитьПустуюТаблицуДрагМеталлы(ОбъектТовары, Объект.СБ_ДрагоценныеМеталлыРасход,, Истина);
	
	//Элементы.ДеревоДрагМеталлы.Очистить();
	//Дерево = РеквизитФормыВЗначение("ДеревоДрагМеталлы");                                            
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Родитель", "Родитель");
	ДеревоИзТаблицы = СБ_РаботаСДрагоценнымиМеталлами.ВыгрузитьТаблицуЗначенийВДеревоЗначений(Объект.СБ_ДрагоценныеМеталлыРасход.Выгрузить(), "РодительНоменклатура", "РодительНоменклатура");
	
	ЗначениеВРеквизитФормы(ДеревоИзТаблицы, "ДеревоДрагМеталлыРасход");                        
	
КонецПроцедуры


&НаКлиенте
Процедура СБ_ТоварыСерияПриИзмененииПосле(Элемент)
	ПересчитатьКоличество(ТекущийЭлемент.ТекущиеДанные.Номенклатура, ТекущийЭлемент.ТекущиеДанные.Характеристика, ТекущийЭлемент.ТекущиеДанные.Серия, ТекущийЭлемент.ТекущиеДанные.КоличествоУпаковок, Объект.Склад, ТекущийЭлемент.ТекущиеДанные.Упаковка);  
	ПроверитьСтрокиВДеревеНаСуществованиеНаСервере();
	ПересчитатьТаблицуДрагоценныеМеталлы();
КонецПроцедуры

&НаКлиенте
Процедура СБ_ТоварыСерияОбработкаВыбораПосле(Элемент, ВыбранноеЗначение, ДополнительныеДанные, ВыборДобавлением, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СБ_ТоварыСерияОкончаниеВводаТекстаПосле(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Функция СБ_ПоискСерии(АдресВоВременномХранилище)
	
	Результат = Новый Структура;
	Результат.Вставить("Серия", Справочники.СерииНоменклатуры.ПустаяСсылка());
	Результат.Вставить("КоличествоУпаковок", 0);
	
	ТаблицаСерийИКоличества = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
	
	Если ТаблицаСерийИКоличества.Количество() > 0 Тогда
		
		СтрокаИзВременногоХранилища = ТаблицаСерийИКоличества.Получить(0);
		
		Результат["Серия"] = СтрокаИзВременногоХранилища.Серия;
		Результат["КоличествоУпаковок"] = СтрокаИзВременногоХранилища.КоличествоУпаковок;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ПроверитьСтрокиНаСуществование(ТаблицаТовары, ДеревоДрагМеталлы) 
	
	Для Каждого СтрокаДерева Из ДеревоДрагМеталлы.Строки Цикл
		СтрокаНайдена = Ложь;
		Для Каждого СтрокаТЧ Из ТаблицаТовары Цикл
			
			Если СтрокаТЧ.Номенклатура = СтрокаДерева.Номенклатура
				И СтрокаТЧ.Характеристика = СтрокаДерева.Характеристика
				И СтрокаТЧ.Серия = СтрокаДерева.Серия Тогда
				СтрокаНайдена = Истина;	
			КонецЕсли;
						
		КонецЦикла;	
		
		Если Не СтрокаНайдена Тогда
			ДеревоДрагМеталлы.Строки.Удалить(СтрокаДерева);		
		КонецЕсли;
		
	КонецЦикла;
	
	
	
КонецПроцедуры 

&НаСервере
Процедура ПроверитьСтрокиВДеревеНаСуществованиеНаСервере() 
	ДеревоВТаблицу = РеквизитФормыВЗначение("ДеревоДрагМеталлы"); 
	ПроверитьСтрокиНаСуществование(Объект.ОтгружаемыеТовары, ДеревоВТаблицу);
	ЗначениеВРеквизитФормы(ДеревоВТаблицу, "ДеревоДрагМеталлы");
КонецПроцедуры

//&НаКлиенте
//&ИзменениеИКонтроль("ТоварыПриАктивизацииСтрокиНаКлиенте")
//Процедура СБ_ТоварыПриАктивизацииСтрокиНаКлиенте()

//	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;

//	Если ТекущаяСтрока <> Неопределено Тогда

//		ВывестиДополнительнуюИнформациюПоНоменклатуре(
//		ТекущаяСтрока.Номенклатура,
//		ТекущаяСтрока.Характеристика,
//		ТекущаяСтрока.Упаковка);

//		Элементы.СписокУпаковок.ТекущаяСтрока = ТекущаяСтрока.Упаковка;

//	Иначе

//		ВывестиДополнительнуюИнформациюПоНоменклатуре();

//	КонецЕсли;
//	
//			
//	//#Вставка     
//	//ПроверитьСтрокиВДеревеНаСуществованиеНаСервере();
//	//#КонецВставки

//КонецПроцедуры
  
&НаКлиенте
Процедура СБ_СкладПриИзмененииПосле(Элемент)	
	Элементы.ГруппаДрагоценныеМеталлы.Видимость = НЕ СкладИспользуетОрдернуюСхему(Объект.Склад); 

	Если НЕ Элементы.ГруппаДрагоценныеМеталлы.Видимость Тогда
		Объект.СБ_ДрагоценныеМеталлы.Очистить();
	Иначе
		СБ_ПересчитатьДрагМеталлыПослеНаСервере();
	КонецЕсли;

КонецПроцедуры 

&НаСервереБезКонтекста
Функция СкладИспользуетОрдернуюСхему(СкладСсылка)	
	Возврат СБ_РаботаСДрагоценнымиМеталлами.СкладИспользуетОрдернуюСхему(СкладСсылка);	
КонецФункции

&НаСервере
Процедура СБ_ОтгружаемыеТоварыВесПриИзмененииПослеНаСервере(Номенклатура, Характеристика, Серия, КоличествоУпаковок, ЛигатурныйВес)
	
	Дерево = РеквизитФормыВЗначение("ДеревоДрагМеталлы"); 
	
	Для Каждого СтрокаДерева Из Дерево.Строки Цикл
		
		Если СтрокаДерева.Номенклатура = Номенклатура И СтрокаДерева.Характеристика = Характеристика И СтрокаДерева.Серия = Серия Тогда 
			
			СтрокаДерева.ЛигатурныйВес = ЛигатурныйВес;
			СтрокаДерева.Количество = КоличествоУпаковок;
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Дерево, "ДеревоДрагМеталлы");
	
	ПересчитатьТаблицуДрагоценныеМеталлы();
	
КонецПроцедуры

&НаКлиенте
Процедура СБ_ОтгружаемыеТоварыВесПриИзмененииПосле(Элемент)
		
	ЭлементФормыДанные = Элементы.ОтгружаемыеТовары.ТекущиеДанные;
	
	СБ_ОтгружаемыеТоварыВесПриИзмененииПослеНаСервере(ЭлементФормыДанные.Номенклатура, ЭлементФормыДанные.Характеристика, ЭлементФормыДанные.Серия, ЭлементФормыДанные.КоличествоУпаковок, ЭлементФормыДанные.Вес);
КонецПроцедуры


#КонецОбласти
